#+TITLE:C Basics 
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Summary for C tutorial sessions
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes

* How should I approach a programming assignment?

1. Understand the problem ("What")

   Example: "Write a C program that defines a constant for the speed
   of light (299792458 meters per second) and asks the user to input a
   time in seconds. Calculate and print the distance light travels
   (speed × time) as an integer."

   This exercise asks you to:
   1) Write a C program (.c)
   2) Define a constant (integer) value
   3) Get an integer value as input
   4) Compute something

2. Plan the solution ("How")

   For the example:
   1) Open Onecompiler.com/c for a =main.c= template
   2) Use ~#define~ for the constant
   3) Use ~scanf~ to get input
   4) Compute by multiplying (~*~) and saving the result (~=~)

3. Implement the solution:

   1) Write the pseudocode
   2) Write the C source code accordingly
   3) Test the program
   4) Fix according to the debugger messages

* What's a C program exactly?

- A C program consists of several parts:

  #+begin_example
  *----------------------------------*
  | Program header:                  |
  | Purpose, author, input/output    |
  *----------------------------------*
  | Preprocessing directives:        |
  | #include [header file]           |
  | #define [constant]               |
  *----------------------------------*
  | main program                     |
  *----------------------------------*
  #+end_example

- The =main= program consists of several parts:

  #+begin_example C
  int main (void)
  {
    // Variable declarations

    // Input from the keyboard

    // Computations with variables 

    // Output results
    
    return 0;
  }
  #+end_example

* ~printf~ and ~scanf~

- The general format of ~printf~ is:

  #+begin_example C
  printf(" [formatting] ", [arguments]);
  #+end_example

- Formatting could be ~%d~ for an integer argument:
  #+begin_src C
    printf("An integer: %d", 100);
  #+end_src

  #+RESULTS:
  : An integer: 100

- The general format of ~scanf~ is:

  #+begin_example C
  scanf(" [formatting] ", [arguments]);
  #+end_example

- But the [formatting] should be minimal, and the [arguments] must be
  addresses. For example, to input an integer, save it in =num=, and
  print the input value:
  #+begin_example C
    int num;
    scanf("%d", &num);
    printf("%d", num);
  #+end_example

* Declaration and initialization

- The following code block declares an integer variable =num=:
  #+begin_src C
    int i;
  #+end_src

- The variable =num= has no value until one is assigned:
  #+begin_src C
    int i;
    i = 100;
  #+end_src

- Alternatively, you can declare and initialize the variable in the
  same statement:
  #+begin_src C
    int i = 100;
  #+end_src
